sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sram_tcm.h
/*!
    \file    gd32a7xx_sram_tcm.h
    \brief   definitions for the SRAM and TCM register

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_SRAM_TCM_H
#define GD32A7XX_SRAM_TCM_H

#include "gd32a7xx.h"

#define SRAM_REG                         SRAMC_BASE                          /*!< SRAM_REG register base address */
#define TCM_REG                          TCMREG_BASE                         /*!< TCM_REG register base address */

/* SRAM_REG registers definitions */
#define SRAM_INTEN                       REG32(SRAM_REG + 0x00000000U)                /*!< SRAM interrupt enable register */
#define SRAM_ERR                         REG32(SRAM_REG + 0x00000004U)                /*!< SRAM error status register  */
#define SRAM_CBEADDR0(m)                 REG32(SRAM_REG + 0x00000008U + 0x00000004U * (m))  /*!< SRAM correctable bit error address 0 for SRAM0/1 register */
#define SRAM_CBEADDR1(m)                 REG32(SRAM_REG + 0x00000010U + 0x00000004U * (m))  /*!< SRAM correctable bit error address 1 for SRAM0/1 register */
#define SRAM_CBEADDR2(m)                 REG32(SRAM_REG + 0x00000018U + 0x00000004U * (m))  /*!< SRAM correctable bit error address 2 for SRAM0/1 register */
#define SRAM_CBEADDR3(m)                 REG32(SRAM_REG + 0x00000020U + 0x00000004U * (m))  /*!< SRAM correctable bit error address 3 for SRAM0/1 register */
#define SRAM_UBEADDR(m)                  REG32(SRAM_REG + 0x00000028U + 0x00000004U * (m))  /*!< SRAM uncorrectable bit error address for SRAM0/1 register */
#define SRAM_BUFVLD                      REG32(SRAM_REG + 0x00000030U)                /*!< SRAM buffer valid register */
#define SRAM_OVF                         REG32(SRAM_REG + 0x00000034U)                /*!< SRAM overflow status register */
#define SRAM_WP                          REG32(SRAM_REG + 0x00000038U)                /*!< SRAM write protection register */
#define SRAM_ECCCERR                     REG32(SRAM_REG + 0x0000003CU)                /*!< SRAM ECC code error status register */

/* TCM_REG registers definitions */
#define TCM_INTEN                        REG32(TCM_REG + 0x00000000U)                 /*!< TCM interrupt enable register */
#define TCM_ERR                          REG32(TCM_REG + 0x00000004U)                 /*!< TCM error status register  */
#define TCM_CBEADDR0(m)                  REG32(TCM_REG + 0x00000008U + 0x00000004U*(m))     /*!< TCM correctable bit error address 0 for \
                                                                                            CM7_0_ITCM/CM7_0_D0TCM/CM7_0_D1TCM/CM7_1_ITCM/CM7_1_D0TCM/CM7_1_D1TCM register */
#define TCM_CBEADDR1(m)                  REG32(TCM_REG + 0x00000020U + 0x00000004U*(m))     /*!< TCM correctable bit error address 1 for \
                                                                                            CM7_0_ITCM/CM7_0_D0TCM/CM7_0_D1TCM/CM7_1_ITCM/CM7_1_D0TCM/CM7_1_D1TCM register */
#define TCM_CBEADDR2(m)                  REG32(TCM_REG + 0x00000038U + 0x00000004U*(m))     /*!< TCM correctable bit error address 2 for \
                                                                                            CM7_0_ITCM/CM7_0_D0TCM/CM7_0_D1TCM/CM7_1_ITCM/CM7_1_D0TCM/CM7_1_D1TCM register */
#define TCM_CBEADDR3(m)                  REG32(TCM_REG + 0x00000050U + 0x00000004U*(m))     /*!< TCM correctable bit error address 3 for \
                                                                                            CM7_0_ITCM/CM7_0_D0TCM/CM7_0_D1TCM/CM7_1_ITCM/CM7_1_D0TCM/CM7_1_D1TCM register */
#define TCM_UBEADDR(m)                   REG32(TCM_REG + 0x00000068U + 0x00000004U*(m))     /*!< TCM uncorrectable bit error address for \
                                                                                            CM7_0_ITCM/CM7_0_D0TCM/CM7_0_D1TCM/CM7_1_ITCM/CM7_1_D0TCM/CM7_1_D1TCM register */
#define TCM_BUFVLD                       REG32(TCM_REG + 0x00000080U)                 /*!< TCM buffer valid register */
#define TCM_OVF                          REG32(TCM_REG + 0x00000084U)                 /*!< TCM overflow status register */
#define TCM_WP                           REG32(TCM_REG + 0x00000088U)                 /*!< TCM write protection register */
#define TCM0_ECCCERR                     REG32(TCM_REG + 0x0000008CU)                 /*!< TCM0 ECC code error status register */
#if defined(GD32A72XX) || defined(GD32A74XX)
#define TCM1_ECCCERR                     REG32(TCM_REG + 0x00000090U)                 /*!< TCM1 ECC code error status register */
#endif

/* SRAM register bits definitions */
/* SRAM_INTEN */
#define SRAM_INTEN_SRAM_CBEIE            BIT(0)                              /*!< SRAM0/1 correctable bit error interrupt enable */
#define SRAM_INTEN_SRAM_UBEIE            BIT(1)                              /*!< SRAM0/1 uncorrectable bit error interrupt enable */
#define SRAM_INTEN_SRAM_OVFIE            BIT(2)                              /*!< SRAM0/1 address buffer overflow interrupt enable */
#define SRAM_INTEN_SRAM_CTLEIE           BIT(3)                              /*!< SRAM0/1 controller redundancy check error interrupt enable */

