sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sram_tcm.h
/* SRAM_ERR */
#define SRAM_ERR_SRAM0_CTLERR            BIT(0)                              /*!< SRAM0 controller redundancy check error flag */
#define SRAM_ERR_SRAM1_CTLERR            BIT(1)                              /*!< SRAM1 controller redundancy check error flag */
#define SRAM_ERR_SRAM0_ECCCERR           BIT(2)                              /*!< SRAM0 ECC single bit correctable error flag */
#define SRAM_ERR_SRAM1_ECCCERR           BIT(3)                              /*!< SRAM0 ECC single bit correctable error flag */
#define SRAM_ERR_SRAM0_ADDRERR           BIT(4)                              /*!< SRAM0 ECC single bit address error flag */
#define SRAM_ERR_SRAM1_ADDRERR           BIT(5)                              /*!< SRAM1 ECC single bit address error flag */
#define SRAM_ERR_SRAM0_ECCUERR           BIT(6)                              /*!< SRAM0 ECC double bit uncorrectable error flag */
#define SRAM_ERR_SRAM1_ECCUERR           BIT(7)                              /*!< SRAM1 ECC double bit uncorrectable error flag */
#define SRAM_ERR_SRAM0_EDCERR            BIT(8)                              /*!< SRAM0 EDC after ECC checker error flag */
#define SRAM_ERR_SRAM1_EDCERR            BIT(9)                              /*!< SRAM1 EDC after ECC checker error flag */

/* SRAM_CEBADDR0 */
#define SRAM_CBEADDR0_SRAM_CBEADDR0      BITS(0,31)                          /*!< first correctable bit error address of SRAM */

/* SRAM_CEBADDR1 */
#define SRAM_CBEADDR1_SRAM_CBEADDR1      BITS(0,31)                          /*!< second correctable bit error address of SRAM */

/* SRAM_CEBADDR2 */
#define SRAM_CBEADDR2_SRAM_CBEADDR2      BITS(0,31)                          /*!< third correctable bit error address of SRAM */

/* SRAM_CEBADDR3 */
#define SRAM_CBEADDR3_SRAM_CBEADDR3      BITS(0,31)                          /*!< fourth correctable bit error address of SRAM */

/* SRAM_UBEADDR */
#define SRAM_UBEADDR_SRAM_UBEADDR        BITS(0,31)                          /*!< un-correctable bit error address of SRAM */

/* SRAM_BUFVLD */
#define SRAM_BUFVLD_SRAM0_CBEADDRVLD0    BIT(0)                              /*!< SRAM0 correctable bit error address0 valid flag */
#define SRAM_BUFVLD_SRAM0_CBEADDRVLD1    BIT(1)                              /*!< SRAM0 correctable bit error address1 valid flag */
#define SRAM_BUFVLD_SRAM0_CBEADDRVLD2    BIT(2)                              /*!< SRAM0 correctable bit error address2 valid flag */
#define SRAM_BUFVLD_SRAM0_CBEADDRVLD3    BIT(3)                              /*!< SRAM0 correctable bit error address3 valid flag */

#define SRAM_BUFVLD_SRAM1_CBEADDRVLD0    BIT(4)                              /*!< SRAM1 correctable bit error address0 valid flag */
#define SRAM_BUFVLD_SRAM1_CBEADDRVLD1    BIT(5)                              /*!< SRAM1 correctable bit error address1 valid flag */
#define SRAM_BUFVLD_SRAM1_CBEADDRVLD2    BIT(6)                              /*!< SRAM1 correctable bit error address2 valid flag */
#define SRAM_BUFVLD_SRAM1_CBEADDRVLD3    BIT(7)                              /*!< SRAM1 correctable bit error address3 valid flag */

#define SRAM_BUFVLD_SRAM0_UBEADDRVLD     BIT(8)                              /*!< SRAM0 un-correctable bit error address valid flag */
#define SRAM_BUFVLD_SRAM1_UBEADDRVLD     BIT(9)                              /*!< SRAM1 un-correctable bit error address valid flag */

/* SRAM_OVF */
#define SRAM_OVF_SRAM0_CBEOVF            BIT(0)                              /*!< SRAM0 correctable bit error address buffer overflow */
#define SRAM_OVF_SRAM1_CBEOVF            BIT(1)                              /*!< SRAM1 correctable bit error address buffer overflow */

/* SRAM_WP */
#define SRAM_WP_SRAM_P0WP                BIT(0)                              /*!< SRAM page 0 write protection bit */
#define SRAM_WP_SRAM_P1WP                BIT(1)                              /*!< SRAM page 1 write protection bit */
#define SRAM_WP_SRAM_P2WP                BIT(2)                              /*!< SRAM page 2 write protection bit */
#define SRAM_WP_SRAM_P3WP                BIT(3)                              /*!< SRAM page 3 write protection bit */
#define SRAM_WP_SRAM_P4WP                BIT(4)                              /*!< SRAM page 4 write protection bit */
#define SRAM_WP_SRAM_P5WP                BIT(5)                              /*!< SRAM page 5 write protection bit */
#define SRAM_WP_SRAM_P6WP                BIT(6)                              /*!< SRAM page 6 write protection bit */
#define SRAM_WP_SRAM_P7WP                BIT(7)                              /*!< SRAM page 7 write protection bit */
#define SRAM_WP_SRAM_P8WP                BIT(8)                              /*!< SRAM page 8 write protection bit */
#define SRAM_WP_SRAM_P9WP                BIT(9)                              /*!< SRAM page 9 write protection bit */
#define SRAM_WP_SRAM_P10WP               BIT(10)                             /*!< SRAM page 10 write protection bit */
#define SRAM_WP_SRAM_P11WP               BIT(11)                             /*!< SRAM page 11 write protection bit */
#define SRAM_WP_SRAM_P12WP               BIT(12)                             /*!< SRAM page 12 write protection bit */
#define SRAM_WP_SRAM_P13WP               BIT(13)                             /*!< SRAM page 13 write protection bit */
#define SRAM_WP_SRAM_P14WP               BIT(14)                             /*!< SRAM page 14 write protection bit */
#define SRAM_WP_SRAM_P15WP               BIT(15)                             /*!< SRAM page 15 write protection bit */
#define SRAM_WP_SRAM_P16WP               BIT(16)                             /*!< SRAM page 16 write protection bit */
#define SRAM_WP_SRAM_P17WP               BIT(17)                             /*!< SRAM page 17 write protection bit */
#define SRAM_WP_SRAM_P18WP               BIT(18)                             /*!< SRAM page 18 write protection bit */
#define SRAM_WP_SRAM_P19WP               BIT(19)                             /*!< SRAM page 19 write protection bit */

/* SRAM_ECCCERR */
#define SRAM_ECCCERR_SRAM0_ECCCDET       BITS(0,8)                           /*!< SRAM0 ecc code calculated with check error detected */
#define SRAM_ECCCERR_SRAM1_ECCCDET       BITS(16,24)                         /*!< SRAM1 ecc code calculated with check error detected */

