sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sram_tcm.h
/* TCM_REG register bits definitions */
/* SRAM_INTEN */
#define TCM_INTEN_TCM0_CBEIE             BIT(0)                              /*!< TCM of CM7_0 correctable bit error interrupt enable */
#define TCM_INTEN_TCM1_CBEIE             BIT(1)                              /*!< TCM of CM7_1 correctable bit error interrupt enable */

#define TCM_INTEN_TCM0_UBEIE             BIT(2)                              /*!< TCM of CM7_0 uncorrectable bit error interrupt enable */
#define TCM_INTEN_TCM1_UBEIE             BIT(3)                              /*!< TCM of CM7_1 uncorrectable bit error interrupt enable */

#define TCM_INTEN_TCM0_OVFIE             BIT(4)                              /*!< TCM of CM7_0 address buffer overflow interrupt enable */
#define TCM_INTEN_TCM1_OVFIE             BIT(5)                              /*!< TCM of CM7_1 address buffer overflow interrupt enable */

#define TCM_INTEN_TCM0_CTLEIE            BIT(6)                              /*!< TCM of CM7_0 controller redundancy check error interrupt enable */
#define TCM_INTEN_TCM1_CTLEIE            BIT(7)                              /*!< TCM of CM7_1 controller redundancy check error interrupt enable */

/* TCM_ERR */
#define TCM_ERR_TCM0_CTLERR              BIT(0)                              /*!< TCM of CM7_0 controller redundancy check error flag */
#define TCM_ERR_TCM1_CTLERR              BIT(1)                              /*!< TCM of CM7_1 controller redundancy check error flag */

#define TCM_ERR_ITCM0_ECCCERR            BIT(2)                              /*!< ITCM of CM7_0 single bit correctable error flag */
#define TCM_ERR_D0TCM0_ECCCERR           BIT(3)                              /*!< D0TCM0 of CM7_0 single bit correctable error flag */
#define TCM_ERR_D1TCM0_ECCCERR           BIT(4)                              /*!< D1TCM0 of CM7_0 single bit correctable error flag */
#define TCM_ERR_ITCM1_ECCCERR            BIT(5)                              /*!< ITCM of CM7_1 single bit correctable error flag */
#define TCM_ERR_D0TCM1_ECCCERR           BIT(6)                              /*!< D0TCM0 of CM7_1 single bit correctable error flag */
#define TCM_ERR_D1TCM1_ECCCERR           BIT(7)                              /*!< D1TCM0 of CM7_1 single bit correctable error flag */

#define TCM_ERR_ITCM0_ADDRERR            BIT(8)                              /*!< ITCM of CM7_0 single bit address error flag */
#define TCM_ERR_D0TCM0_ADDRERR           BIT(9)                              /*!< D0TCM0 of CM7_0 single bit address error flag */
#define TCM_ERR_D1TCM0_ADDRERR           BIT(10)                             /*!< D1TCM0 of CM7_0 single bit address error flag */
#define TCM_ERR_ITCM1_ADDRERR            BIT(11)                             /*!< ITCM of CM7_1 single bit address error flag */
#define TCM_ERR_D0TCM1_ADDRERR           BIT(12)                             /*!< D0TCM0 of CM7_1 single bit address error flag */
#define TCM_ERR_D1TCM1_ADDRERR           BIT(13)                             /*!< D1TCM0 of CM7_1 single bit address error flag */

#define TCM_ERR_ITCM0_ECCUERR            BIT(16)                             /*!< ITCM of CM7_0 ECC double bit uncorrectable error flag */
#define TCM_ERR_D0TCM0_ECCUERR           BIT(17)                             /*!< D0TCM0 of CM7_0 ECC double bit uncorrectable error flag */
#define TCM_ERR_D1TCM0_ECCUERR           BIT(18)                             /*!< D1TCM0 of CM7_0 ECC double bit uncorrectable error flag */
#define TCM_ERR_ITCM1_ECCUERR            BIT(19)                             /*!< ITCM of CM7_1 ECC double bit uncorrectable error flag */
#define TCM_ERR_D0TCM1_ECCUERR           BIT(20)                             /*!< D0TCM0 of CM7_1 ECC double bit uncorrectable error flag */
#define TCM_ERR_D1TCM1_ECCUERR           BIT(21)                             /*!< D1TCM0 of CM7_1 ECC double bit uncorrectable error flag */

#define TCM_ERR_ITCM0_EDCERR             BIT(24)                             /*!< ITCM of CM7_0 EDC after ECC checker error flag */
#define TCM_ERR_D0TCM0_EDCERR            BIT(25)                             /*!< D0TCM0 of CM7_0 EDC after ECC checker error flag */
#define TCM_ERR_D1TCM0_EDCERR            BIT(26)                             /*!< D1TCM0 of CM7_0 EDC after ECC checker error flag */
#define TCM_ERR_ITCM1_EDCERR             BIT(27)                             /*!< ITCM of CM7_1 EDC after ECC checker error flag */
#define TCM_ERR_D0TCM1_EDCERR            BIT(28)                             /*!< D0TCM0 of CM7_1 EDC after ECC checker error flag */
#define TCM_ERR_D1TCM1_EDCERR            BIT(29)                             /*!< D1TCM0 of CM7_1 EDC after ECC checker error flag */

/* TCM_CEBADDR0 */
#define TCM_CBEADDR0_TCM_CBEADDR0        BITS(0,31)                          /*!< first correctable bit error address of TCM */

/* TCM_CEBADDR1 */
#define TCM_CBEADDR1_TCM_CBEADDR1        BITS(0,31)                          /*!< second correctable bit error address of TCM */

/* TCM_CEBADDR2 */
#define TCM_CBEADDR2_TCM_CBEADDR2        BITS(0,31)                          /*!< third correctable bit error address of TCM */

/* TCM_CEBADDR3 */
#define TCM_CBEADDR3_TCM_CBEADDR3        BITS(0,31)                          /*!< fourth correctable bit error address of TCM */

/* TCM_UBEADDR */
#define TCM_UBEADDR_TCM_UBEADDR          BITS(0,31)                          /*!< un-correctable bit error address of TCM */

/* TCM_BUFVLD */
#define TCM_BUFVLD_ITCM0_CBEADDRVLD0     BIT(0)                              /*!< ITCM of CM7_0 correctable bit error address0 valid flag */
#define TCM_BUFVLD_ITCM0_CBEADDRVLD1     BIT(1)                              /*!< ITCM of CM7_0 correctable bit error address1 valid flag */
#define TCM_BUFVLD_ITCM0_CBEADDRVLD2     BIT(2)                              /*!< ITCM of CM7_0 correctable bit error address2 valid flag */
#define TCM_BUFVLD_ITCM0_CBEADDRVLD3     BIT(3)                              /*!< ITCM of CM7_0 correctable bit error address3 valid flag */

#define TCM_BUFVLD_D0TCM0_CBEADDRVLD0    BIT(4)                              /*!< D0TCM of CM7_0 correctable bit error address0 valid flag */
#define TCM_BUFVLD_D0TCM0_CBEADDRVLD1    BIT(5)                              /*!< D0TCM of CM7_0 correctable bit error address1 valid flag */
#define TCM_BUFVLD_D0TCM0_CBEADDRVLD2    BIT(6)                              /*!< D0TCM of CM7_0 correctable bit error address2 valid flag */
#define TCM_BUFVLD_D0TCM0_CBEADDRVLD3    BIT(7)                              /*!< D0TCM of CM7_0 correctable bit error address3 valid flag */

#define TCM_BUFVLD_D1TCM0_CBEADDRVLD0    BIT(8)                              /*!< D1TCM of CM7_0 correctable bit error address0 valid flag */
#define TCM_BUFVLD_D1TCM0_CBEADDRVLD1    BIT(9)                              /*!< D1TCM of CM7_0 correctable bit error address1 valid flag */
#define TCM_BUFVLD_D1TCM0_CBEADDRVLD2    BIT(10)                             /*!< D1TCM of CM7_0 correctable bit error address2 valid flag */
#define TCM_BUFVLD_D1TCM0_CBEADDRVLD3    BIT(11)                             /*!< D1TCM of CM7_0 correctable bit error address3 valid flag */

