sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sram_tcm.h
#define TCM_BUFVLD_ITCM1_CBEADDRVLD0     BIT(12)                             /*!< ITCM of CM7_1 correctable bit error address0 valid flag */
#define TCM_BUFVLD_ITCM1_CBEADDRVLD1     BIT(13)                             /*!< ITCM of CM7_1 correctable bit error address1 valid flag */
#define TCM_BUFVLD_ITCM1_CBEADDRVLD2     BIT(14)                             /*!< ITCM of CM7_1 correctable bit error address2 valid flag */
#define TCM_BUFVLD_ITCM1_CBEADDRVLD3     BIT(15)                             /*!< ITCM of CM7_1 correctable bit error address3 valid flag */

#define TCM_BUFVLD_D0TCM1_CBEADDRVLD0    BIT(16)                             /*!< D0TCM of CM7_1 correctable bit error address0 valid flag */
#define TCM_BUFVLD_D0TCM1_CBEADDRVLD1    BIT(17)                             /*!< D0TCM of CM7_1 correctable bit error address1 valid flag */
#define TCM_BUFVLD_D0TCM1_CBEADDRVLD2    BIT(18)                             /*!< D0TCM of CM7_1 correctable bit error address2 valid flag */
#define TCM_BUFVLD_D0TCM1_CBEADDRVLD3    BIT(19)                             /*!< D0TCM of CM7_1 correctable bit error address3 valid flag */

#define TCM_BUFVLD_D1TCM1_CBEADDRVLD0    BIT(20)                             /*!< D1TCM of CM7_1 correctable bit error address0 valid flag */
#define TCM_BUFVLD_D1TCM1_CBEADDRVLD1    BIT(21)                             /*!< D1TCM of CM7_1 correctable bit error address1 valid flag */
#define TCM_BUFVLD_D1TCM1_CBEADDRVLD2    BIT(22)                             /*!< D1TCM of CM7_1 correctable bit error address2 valid flag */
#define TCM_BUFVLD_D1TCM1_CBEADDRVLD3    BIT(23)                             /*!< D1TCM of CM7_1 correctable bit error address3 valid flag */

#define TCM_BUFVLD_ITCM0_UBEADDRVLD      BIT(26)                             /*!< ITCM of CM7_0 un-correctable bit error address valid flag */
#define TCM_BUFVLD_D0TCM0_UBEADDRVLD     BIT(27)                             /*!< D0TCM of CM7_0 un-correctable bit error address valid flag */
#define TCM_BUFVLD_D1TCM0_UBEADDRVLD     BIT(28)                             /*!< D1TCM of CM7_0 un-correctable bit error address valid flag */

#define TCM_BUFVLD_ITCM1_UBEADDRVLD      BIT(29)                             /*!< ITCM of CM7_1 un-correctable bit error address valid flag */
#define TCM_BUFVLD_D0TCM1_UBEADDRVLD     BIT(30)                             /*!< D0TCM of CM7_1 un-correctable bit error address valid flag */
#define TCM_BUFVLD_D1TCM1_UBEADDRVLD     BIT(31)                             /*!< D1TCM of CM7_1 un-correctable bit error address valid flag */

/* TCM_OVF */
#define TCM_OVF_ITCM0_CBEOVF             BIT(0)                              /*!< ITCM of CM7_0 correctable bit error address buffer overflow */
#define TCM_OVF_D0TCM0_CBEOVF            BIT(1)                              /*!< D0TCM of CM7_0 correctable bit error address buffer overflow */
#define TCM_OVF_D1TCM0_CBEOVF            BIT(2)                              /*!< D1TCM of CM7_0 correctable bit error address buffer overflow */
#define TCM_OVF_ITCM1_CBEOVF             BIT(3)                              /*!< ITCM of CM7_1 correctable bit error address buffer overflow */
#define TCM_OVF_D0TCM1_CBEOVF            BIT(4)                              /*!< D0TCM of CM7_1 correctable bit error address buffer overflow */
#define TCM_OVF_D1TCM1_CBEOVF            BIT(5)                              /*!< D1TCM of CM7_1 correctable bit error address buffer overflow */

/* TCM_WP */
#define TCM_WP_ITCM0_P0WP                BIT(0)                              /*!< ITCM of CM7_0 page 0 write protection bit */
#define TCM_WP_ITCM0_P1WP                BIT(1)                              /*!< ITCM of CM7_0 page 1 write protection bit */
#define TCM_WP_ITCM0_P2WP                BIT(2)                              /*!< ITCM of CM7_0 page 2 write protection bit */
#define TCM_WP_ITCM0_P3WP                BIT(3)                              /*!< ITCM of CM7_0 page 3 write protection bit */

#define TCM_WP_ITCM1_P0WP                BIT(4)                              /*!< ITCM of CM7_1 page 0 write protection bit */
#define TCM_WP_ITCM1_P1WP                BIT(5)                              /*!< ITCM of CM7_1 page 1 write protection bit */
#define TCM_WP_ITCM1_P2WP                BIT(6)                              /*!< ITCM of CM7_1 page 2 write protection bit */
#define TCM_WP_ITCM1_P3WP                BIT(7)                              /*!< ITCM of CM7_1 page 3 write protection bit */

#define TCM_WP_DTCM0_P0WP                BIT(16)                             /*!< DTCM of CM7_0 page 0 write protection bit */
#define TCM_WP_DTCM0_P1WP                BIT(17)                             /*!< DTCM of CM7_0 page 1 write protection bit */
#define TCM_WP_DTCM0_P2WP                BIT(18)                             /*!< DTCM of CM7_0 page 2 write protection bit */
#define TCM_WP_DTCM0_P3WP                BIT(19)                             /*!< DTCM of CM7_0 page 3 write protection bit */
#define TCM_WP_DTCM0_P4WP                BIT(20)                             /*!< DTCM of CM7_0 page 4 write protection bit */
#define TCM_WP_DTCM0_P5WP                BIT(21)                             /*!< DTCM of CM7_0 page 5 write protection bit */
#define TCM_WP_DTCM0_P6WP                BIT(22)                             /*!< DTCM of CM7_0 page 6 write protection bit */
#define TCM_WP_DTCM0_P7WP                BIT(23)                             /*!< DTCM of CM7_0 page 7 write protection bit */

#define TCM_WP_DTCM1_P0WP                BIT(24)                             /*!< DTCM of CM7_1 page 0 write protection bit */
#define TCM_WP_DTCM1_P1WP                BIT(25)                             /*!< DTCM of CM7_1 page 1 write protection bit */
#define TCM_WP_DTCM1_P2WP                BIT(26)                             /*!< DTCM of CM7_1 page 2 write protection bit */
#define TCM_WP_DTCM1_P3WP                BIT(27)                             /*!< DTCM of CM7_1 page 3 write protection bit */
#define TCM_WP_DTCM1_P4WP                BIT(28)                             /*!< DTCM of CM7_1 page 4 write protection bit */
#define TCM_WP_DTCM1_P5WP                BIT(29)                             /*!< DTCM of CM7_1 page 5 write protection bit */
#define TCM_WP_DTCM1_P6WP                BIT(30)                             /*!< DTCM of CM7_1 page 6 write protection bit */
#define TCM_WP_DTCM1_P7WP                BIT(31)                             /*!< DTCM of CM7_1 page 7 write protection bit */

/* TCM0_ECCCERR */
#define TCM0_ECCCERR_ITCM0_ECCCDET       BITS(0,8)                           /*!< ITCM0 of CM7_0 ecc code calculated with check error detected */
#define TCM0_ECCCERR_D0TCM0_ECCCDET      BITS(16,23)                         /*!< D0TCM0 of CM7_0 ecc code calculated with check error detected */
#define TCM0_ECCCERR_D1TCM0_ECCCDET      BITS(24,31)                         /*!< D1TCM0 of CM7_0 ecc code calculated with check error detected */

