sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sram_tcm.h
/* TCM1_ECCCERR */
#define TCM1_ECCCERR_ITCM1_ECCCDET       BITS(0,8)                           /*!< ITCM1 of CM7_1 ecc code calculated with check error detected */
#define TCM1_ECCCERR_D0TCM1_ECCCDET      BITS(16,23)                         /*!< D0TCM1 of CM7_1 ecc code calculated with check error detected */
#define TCM1_ECCCERR_D1TCM1_ECCCDET      BITS(24,31)                         /*!< D1TCM1 of CM7_1 ecc code calculated with check error detected */

/* constants definitions */
/* SRAM ID */
#define SRAM_ID_SRAM0                           ((uint32_t)0U)               /*!< SRAM0 */
#define SRAM_ID_SRAM1                           ((uint32_t)1U)               /*!< SRAM1 */

/* TCM ID */
#define TCM_ID_ITCM0                            ((uint32_t)0U)               /*!< ITCM of CM7_0 */
#define TCM_ID_D0TCM0                           ((uint32_t)1U)               /*!< D0TCM of CM7_0 */
#define TCM_ID_D1TCM0                           ((uint32_t)2U)               /*!< D1TCM of CM7_0 */
#define TCM_ID_ITCM1                            ((uint32_t)3U)               /*!< ITCM of CM7_1 */
#define TCM_ID_D0TCM1                           ((uint32_t)4U)               /*!< D0TCM of CM7_1 */
#define TCM_ID_D1TCM1                           ((uint32_t)5U)               /*!< D1TCM of CM7_1 */

/* SRAM0/1 interrupt enable/disable */
#define SRAM_INT_CORRECTABLE_ERROR              SRAM_INTEN_SRAM_CBEIE        /*!< SRAM single bit ecc error interrupt */
#define SRAM_INT_UNCORRECTABLE_ERROR            SRAM_INTEN_SRAM_UBEIE        /*!< SRAM double bit ecc error interrupt */
#define SRAM_INT_ADDRESS_BUFFER_OVERFLOW        SRAM_INTEN_SRAM_OVFIE        /*!< SRAM ecc error address buffer overflow interrupt */
#define SRAM_INT_CONTROLLER_REDUNDANCY_CHECK    SRAM_INTEN_SRAM_CTLEIE       /*!< SRAM controller redundancy check error interrupt */

/* TCM interrupt enable/disable */
#define TCM_INT_CORRECTABLE_ERROR               TCM_INTEN_TCM0_CBEIE         /*!< TCM single bit ecc error interrupt */
#define TCM_INT_UNCORRECTABLE_ERROR             TCM_INTEN_TCM0_UBEIE         /*!< TCM double bit ecc error interrupt */
#define TCM_INT_ADDRESS_BUFFER_OVERFLOW         TCM_INTEN_TCM0_OVFIE         /*!< TCM ecc error address buffer overflow interrupt */
#define TCM_INT_CONTROLLER_REDUNDANCY_CHECK     TCM_INTEN_TCM0_CTLEIE        /*!< TCM controller redundancy check error interrupt */

/* SRAM error flag */
#define SRAM_FLAG_CTLERR                        SRAM_ERR_SRAM0_CTLERR        /*!< SRAM controller redundancy check error flag */
#define SRAM_FLAG_ECCCERR                       SRAM_ERR_SRAM0_ECCCERR       /*!< SRAM ECC single bit ecc error flag */
#define SRAM_FLAG_ADDRERR                       SRAM_ERR_SRAM0_ADDRERR       /*!< SRAM ECC single bit address error flag */
#define SRAM_FLAG_ECCUERR                       SRAM_ERR_SRAM0_ECCUERR       /*!< SRAM ECC double bit ecc error flag */
#define SRAM_FLAG_EDCERR                        SRAM_ERR_SRAM0_EDCERR        /*!< SRAM EDC after ECC checker error flag */

/* TCM error flag */
#define TCM_FLAG_CTLERR                         TCM_ERR_TCM0_CTLERR          /*!< TCM controller redundancy check error flag */
#define TCM_FLAG_ECCCERR                        TCM_ERR_ITCM0_ECCCERR        /*!< TCM ECC single bit ecc error flag */
#define TCM_FLAG_ADDRERR                        TCM_ERR_ITCM0_ADDRERR        /*!< TCM ECC single bit address error flag */
#define TCM_FLAG_ECCUERR                        TCM_ERR_ITCM0_ECCUERR        /*!< TCM ECC double bit ecc error flag */
#define TCM_FLAG_EDCERR                         TCM_ERR_ITCM0_EDCERR         /*!< TCM EDC after ECC checker error flag */

/* write protection for sram page(16KB) */
#define SRAM_WP_SRAM0_P0                        SRAM_WP_SRAM_P0WP            /*!< SRAM0 page 0 write protection bit */
#define SRAM_WP_SRAM0_P1                        SRAM_WP_SRAM_P1WP            /*!< SRAM0 page 1 write protection bit */
#define SRAM_WP_SRAM0_P2                        SRAM_WP_SRAM_P2WP            /*!< SRAM0 page 2 write protection bit */
#define SRAM_WP_SRAM0_P3                        SRAM_WP_SRAM_P3WP            /*!< SRAM0 page 3 write protection bit */
#define SRAM_WP_SRAM0_P4                        SRAM_WP_SRAM_P4WP            /*!< SRAM0 page 4 write protection bit */
#define SRAM_WP_SRAM0_P5                        SRAM_WP_SRAM_P5WP            /*!< SRAM0 page 5 write protection bit */
#define SRAM_WP_SRAM0_P6                        SRAM_WP_SRAM_P6WP            /*!< SRAM0 page 6 write protection bit */
#define SRAM_WP_SRAM0_P7                        SRAM_WP_SRAM_P7WP            /*!< SRAM0 page 7 write protection bit */
#define SRAM_WP_SRAM0_P8                        SRAM_WP_SRAM_P8WP            /*!< SRAM0 page 8 write protection bit */
#define SRAM_WP_SRAM0_P9                        SRAM_WP_SRAM_P9WP            /*!< SRAM0 page 9 write protection bit */
#define SRAM_WP_SRAM1_P0                        SRAM_WP_SRAM_P10WP           /*!< SRAM1 page 0 write protection bit */
#define SRAM_WP_SRAM1_P1                        SRAM_WP_SRAM_P11WP           /*!< SRAM1 page 1 write protection bit */
#define SRAM_WP_SRAM1_P2                        SRAM_WP_SRAM_P12WP           /*!< SRAM1 page 2 write protection bit */
#define SRAM_WP_SRAM1_P3                        SRAM_WP_SRAM_P13WP           /*!< SRAM1 page 3 write protection bit */
#define SRAM_WP_SRAM1_P4                        SRAM_WP_SRAM_P14WP           /*!< SRAM1 page 4 write protection bit */
#define SRAM_WP_SRAM1_P5                        SRAM_WP_SRAM_P15WP           /*!< SRAM1 page 5 write protection bit */
#define SRAM_WP_SRAM1_P6                        SRAM_WP_SRAM_P16WP           /*!< SRAM1 page 6 write protection bit */
#define SRAM_WP_SRAM1_P7                        SRAM_WP_SRAM_P17WP           /*!< SRAM1 page 7 write protection bit */
#define SRAM_WP_SRAM1_P8                        SRAM_WP_SRAM_P18WP           /*!< SRAM1 page 8 write protection bit */
#define SRAM_WP_SRAM1_P9                        SRAM_WP_SRAM_P19WP           /*!< SRAM1 page 9 write protection bit */
#define SRAM_WP_SRAM0_ALL                       BITS(0,9)                    /*!< SRAM0 all page write protection bit */
#define SRAM_WP_SRAM1_ALL                       BITS(10,19)                  /*!< SRAM1 all page write protection bit */
#define SRAM_WP_ALL                             BITS(0,19)                   /*!< SRAM0/1 all page write protection bit */

