sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sram_tcm.h
/* write protection for sram page(8KB) */
#define TCM_WP_ITCM0_P0                         TCM_WP_ITCM0_P0WP            /*!< ITCM of CM7_0 page 0 write protection bit */
#define TCM_WP_ITCM0_P1                         TCM_WP_ITCM0_P1WP            /*!< ITCM of CM7_0 page 1 write protection bit */
#define TCM_WP_ITCM0_P2                         TCM_WP_ITCM0_P2WP            /*!< ITCM of CM7_0 page 2 write protection bit */
#define TCM_WP_ITCM0_P3                         TCM_WP_ITCM0_P3WP            /*!< ITCM of CM7_0 page 3 write protection bit */

#define TCM_WP_ITCM1_P0                         TCM_WP_ITCM1_P0WP            /*!< ITCM of CM7_1 page 0 write protection bit */
#define TCM_WP_ITCM1_P1                         TCM_WP_ITCM1_P1WP            /*!< ITCM of CM7_1 page 1 write protection bit */
#define TCM_WP_ITCM1_P2                         TCM_WP_ITCM1_P2WP            /*!< ITCM of CM7_1 page 2 write protection bit */
#define TCM_WP_ITCM1_P3                         TCM_WP_ITCM1_P3WP            /*!< ITCM of CM7_1 page 3 write protection bit */

#define TCM_WP_DTCM0_P0                         TCM_WP_DTCM0_P0WP            /*!< DTCM of CM7_0 page 0 write protection bit */
#define TCM_WP_DTCM0_P1                         TCM_WP_DTCM0_P1WP            /*!< DTCM of CM7_0 page 1 write protection bit */
#define TCM_WP_DTCM0_P2                         TCM_WP_DTCM0_P2WP            /*!< DTCM of CM7_0 page 2 write protection bit */
#define TCM_WP_DTCM0_P3                         TCM_WP_DTCM0_P3WP            /*!< DTCM of CM7_0 page 3 write protection bit */
#define TCM_WP_DTCM0_P4                         TCM_WP_DTCM0_P4WP            /*!< DTCM of CM7_0 page 4 write protection bit */
#define TCM_WP_DTCM0_P5                         TCM_WP_DTCM0_P5WP            /*!< DTCM of CM7_0 page 5 write protection bit */
#define TCM_WP_DTCM0_P6                         TCM_WP_DTCM0_P6WP            /*!< DTCM of CM7_0 page 6 write protection bit */
#define TCM_WP_DTCM0_P7                         TCM_WP_DTCM0_P7WP            /*!< DTCM of CM7_0 page 7 write protection bit */

#define TCM_WP_DTCM1_P0                         TCM_WP_DTCM1_P0WP            /*!< DTCM of CM7_1 page 0 write protection bit */
#define TCM_WP_DTCM1_P1                         TCM_WP_DTCM1_P1WP            /*!< DTCM of CM7_1 page 1 write protection bit */
#define TCM_WP_DTCM1_P2                         TCM_WP_DTCM1_P2WP            /*!< DTCM of CM7_1 page 2 write protection bit */
#define TCM_WP_DTCM1_P3                         TCM_WP_DTCM1_P3WP            /*!< DTCM of CM7_1 page 3 write protection bit */
#define TCM_WP_DTCM1_P4                         TCM_WP_DTCM1_P4WP            /*!< DTCM of CM7_1 page 4 write protection bit */
#define TCM_WP_DTCM1_P5                         TCM_WP_DTCM1_P5WP            /*!< DTCM of CM7_1 page 5 write protection bit */
#define TCM_WP_DTCM1_P6                         TCM_WP_DTCM1_P6WP            /*!< DTCM of CM7_1 page 6 write protection bit */
#define TCM_WP_DTCM1_P7                         TCM_WP_DTCM1_P7WP            /*!< DTCM of CM7_1 page 7 write protection bit */

#define TCM_WP_ITCM0_ALL                        BITS(0,3)                    /*!< ITCM0 all page write protection bit */
#define TCM_WP_ITCM1_ALL                        BITS(4,7)                    /*!< ITCM1 all page write protection bit */
#define TCM_WP_DTCM0_ALL                        BITS(16,23)                  /*!< DTCM0 all page write protection bit */
#define TCM_WP_DTCM1_ALL                        BITS(24,31)                  /*!< DTCM1 all page write protection bit */
#define TCM_WP_ALL                              (BITS(0,7) | BITS(16,31))    /*!< TCM all page write protection bit */

/* single bit ecc error address index */
#define ECC_CBE_ADDRESS0                        ((uint32_t)0U)               /*!< single bit ecc error address index0 */
#define ECC_CBE_ADDRESS1                        ((uint32_t)1U)               /*!< single bit ecc error address index1 */
#define ECC_CBE_ADDRESS2                        ((uint32_t)2U)               /*!< single bit ecc error address index2 */
#define ECC_CBE_ADDRESS3                        ((uint32_t)3U)               /*!< single bit ecc error address index3 */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check SRAM ID */
#define NOT_SRAM_ID(id)                         (((id) != SRAM_ID_SRAM0) && \
                                                 ((id) != SRAM_ID_SRAM1))
/* check SRAM interrupt */
#define NOT_SRAM_INTERRUPT(interrupt)           (((interrupt) != SRAM_INT_CORRECTABLE_ERROR          )   && \
                                                 ((interrupt) != SRAM_INT_UNCORRECTABLE_ERROR        )   && \
                                                 ((interrupt) != SRAM_INT_ADDRESS_BUFFER_OVERFLOW    )   && \
                                                 ((interrupt) != SRAM_INT_CONTROLLER_REDUNDANCY_CHECK))

/* check SRAM get flag */
#define NOT_SRAM_GET_FLAG(flag)                 (((flag) != SRAM_FLAG_CTLERR )   && \
                                                 ((flag) != SRAM_FLAG_ECCCERR)   && \
                                                 ((flag) != SRAM_FLAG_ADDRERR)   && \
                                                 ((flag) != SRAM_FLAG_ECCUERR)   && \
                                                 ((flag) != SRAM_FLAG_EDCERR ))

/* check SRAM clear flag */
#define NOT_SRAM_CLEAR_FLAG(flag)               (((flag) != SRAM_FLAG_CTLERR )   && \
                                                 ((flag) != SRAM_FLAG_ECCCERR)   && \
                                                 ((flag) != SRAM_FLAG_ADDRERR)   && \
                                                 ((flag) != SRAM_FLAG_ECCUERR)   && \
                                                 ((flag) != SRAM_FLAG_EDCERR ))

/* check the range of SRAM address index */
#define NOT_SRAM_ADDRESS_INDEX(index)           (((index) != ECC_CBE_ADDRESS0)   && \
                                                 ((index) != ECC_CBE_ADDRESS1)   && \
                                                 ((index) != ECC_CBE_ADDRESS2)   && \
                                                 ((index) != ECC_CBE_ADDRESS3))

/* check SRAM write protection page */
#define NOT_SRAM_WP_PAGE(page)                  (((page) != SRAM_WP_SRAM0_P0 )   && \
                                                 ((page) != SRAM_WP_SRAM0_P1 )   && \
                                                 ((page) != SRAM_WP_SRAM0_P2 )   && \
                                                 ((page) != SRAM_WP_SRAM0_P3 )   && \
                                                 ((page) != SRAM_WP_SRAM0_P4 )   && \
                                                 ((page) != SRAM_WP_SRAM0_P5 )   && \
                                                 ((page) != SRAM_WP_SRAM0_P6 )   && \
                                                 ((page) != SRAM_WP_SRAM0_P7 )   && \
                                                 ((page) != SRAM_WP_SRAM0_P8 )   && \
                                                 ((page) != SRAM_WP_SRAM0_P9 )   && \
                                                 ((page) != SRAM_WP_SRAM1_P0 )   && \
                                                 ((page) != SRAM_WP_SRAM1_P1 )   && \
                                                 ((page) != SRAM_WP_SRAM1_P2 )   && \
                                                 ((page) != SRAM_WP_SRAM1_P3 )   && \
                                                 ((page) != SRAM_WP_SRAM1_P4 )   && \
                                                 ((page) != SRAM_WP_SRAM1_P5 )   && \
                                                 ((page) != SRAM_WP_SRAM1_P6 )   && \
                                                 ((page) != SRAM_WP_SRAM1_P7 )   && \
                                                 ((page) != SRAM_WP_SRAM1_P8 )   && \
                                                 ((page) != SRAM_WP_SRAM1_P9 )   && \
                                                 ((page) != SRAM_WP_SRAM0_ALL)   && \
                                                 ((page) != SRAM_WP_SRAM1_ALL)   && \
                                                 ((page) != SRAM_WP_ALL      ))

/* check TCM ID */
#define NOT_TCM_ID(id)                          (((id) != TCM_ID_ITCM0  ) && \
                                                 ((id) != TCM_ID_D0TCM0 ) && \
                                                 ((id) != TCM_ID_D1TCM0 ) && \
                                                 ((id) != TCM_ID_ITCM1  ) && \
                                                 ((id) != TCM_ID_D0TCM1 ) && \
                                                 ((id) != TCM_ID_D1TCM1 ))

/* check TCM interrupt */
#define NOT_TCM_INTERRUPT(interrupt)            (((interrupt) != TCM_INT_CORRECTABLE_ERROR          )   && \
                                                 ((interrupt) != TCM_INT_UNCORRECTABLE_ERROR        )   && \
                                                 ((interrupt) != TCM_INT_ADDRESS_BUFFER_OVERFLOW    )   && \
                                                 ((interrupt) != TCM_INT_CONTROLLER_REDUNDANCY_CHECK))

/* check TCM get flag */
#define NOT_TCM_GET_FLAG(flag)                  (((flag) != TCM_FLAG_CTLERR )   && \
                                                 ((flag) != TCM_FLAG_ECCCERR)   && \
                                                 ((flag) != TCM_FLAG_ADDRERR)   && \
                                                 ((flag) != TCM_FLAG_ECCUERR)   && \
                                                 ((flag) != TCM_FLAG_EDCERR ))

