sorosaulong-ux/gd32-test-project/Library/gd32a7xx_sram_tcm.h
/* check TCM clear flag */
#define NOT_TCM_CLEAR_FLAG(flag)                (((flag) != TCM_FLAG_CTLERR )   && \
                                                 ((flag) != TCM_FLAG_ECCCERR)   && \
                                                 ((flag) != TCM_FLAG_ADDRERR)   && \
                                                 ((flag) != TCM_FLAG_ECCUERR)   && \
                                                 ((flag) != TCM_FLAG_EDCERR ))

/* check the range of TCM address index */
#define NOT_TCM_ADDRESS_INDEX(index)            (((index) != ECC_CBE_ADDRESS0)   && \
                                                 ((index) != ECC_CBE_ADDRESS1)   && \
                                                 ((index) != ECC_CBE_ADDRESS2)   && \
                                                 ((index) != ECC_CBE_ADDRESS3))

/* check TCM write protection page */
#define NOT_TCM_WP_PAGE(page)                   (((page) != TCM_WP_ITCM0_P0 )   && \
                                                 ((page) != TCM_WP_ITCM0_P1 )   && \
                                                 ((page) != TCM_WP_ITCM0_P2 )   && \
                                                 ((page) != TCM_WP_ITCM0_P3 )   && \
                                                 ((page) != TCM_WP_ITCM1_P0 )   && \
                                                 ((page) != TCM_WP_ITCM1_P1 )   && \
                                                 ((page) != TCM_WP_ITCM1_P2 )   && \
                                                 ((page) != TCM_WP_ITCM1_P3 )   && \
                                                 ((page) != TCM_WP_DTCM0_P0 )   && \
                                                 ((page) != TCM_WP_DTCM0_P1 )   && \
                                                 ((page) != TCM_WP_DTCM0_P2 )   && \
                                                 ((page) != TCM_WP_DTCM0_P3 )   && \
                                                 ((page) != TCM_WP_DTCM0_P4 )   && \
                                                 ((page) != TCM_WP_DTCM0_P5 )   && \
                                                 ((page) != TCM_WP_DTCM0_P6 )   && \
                                                 ((page) != TCM_WP_DTCM0_P7 )   && \
                                                 ((page) != TCM_WP_DTCM1_P0 )   && \
                                                 ((page) != TCM_WP_DTCM1_P1 )   && \
                                                 ((page) != TCM_WP_DTCM1_P2 )   && \
                                                 ((page) != TCM_WP_DTCM1_P3 )   && \
                                                 ((page) != TCM_WP_DTCM1_P4 )   && \
                                                 ((page) != TCM_WP_DTCM1_P5 )   && \
                                                 ((page) != TCM_WP_DTCM1_P6 )   && \
                                                 ((page) != TCM_WP_DTCM1_P7 )   && \
                                                 ((page) != TCM_WP_ITCM0_ALL)   && \
                                                 ((page) != TCM_WP_ITCM1_ALL)   && \
                                                 ((page) != TCM_WP_DTCM0_ALL)   && \
                                                 ((page) != TCM_WP_DTCM1_ALL)   && \
                                                 ((page) != TCM_WP_ALL      ))
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* enable sram0/1 ecc error interrupt */
void sram_ecc_interrupt_enable(uint32_t interrupt);
/* disable sram0/1 and tcm ecc error interrupt */
void sram_ecc_interrupt_disable(uint32_t interrupt);
/* get sram0/1 error flag is set or not */
FlagStatus sram_error_flag_get(uint32_t sram_id, uint32_t flag);
/* clear sram0/1 error flag */
void sram_error_flag_clear(uint32_t sram_id, uint32_t flag);

/* get sram0/1 single bit ecc error address */
uint32_t sram_ecc_single_bit_address_get(uint32_t sram_id, uint32_t address_idx);
/* get sram0/1 double bit ecc error address */
uint32_t sram_ecc_double_bit_address_get(uint32_t sram_id);
/* get sram0/1 single bit ecc error address valid status */
FlagStatus sram_ecc_single_bit_address_valid_get(uint32_t sram_id, uint32_t address_idx);
/* get sram0/1 mutli bit ecc error address valid status */
FlagStatus sram_ecc_double_bit_address_valid_get(uint32_t sram_id);
/* clear sram0/1 single bit ecc error address valid status */
void sram_ecc_single_bit_address_valid_clear(uint32_t sram_id, uint32_t address_idx);
/* clear sram0/1 mutli bit ecc error address valid status */
void sram_ecc_double_bit_address_valid_clear(uint32_t sram_id);
/* get sram0/1 single bit ecc error address buffer overflow status */
FlagStatus sram_error_address_buffer_overflow_get(uint32_t sram_id);
/* clear sram0/1 single bit ecc error address buffer overflow status */
void sram_error_address_buffer_overflow_clear(uint32_t sram_id);

/* get sram0/1 ecc code of detected ecc error  */
uint32_t sram_ecc_code_get(uint32_t sram_id);
/* configure sram0/1 write protection */
void sram_write_protect_config(uint32_t wp_page, ControlStatus enable);
/* get sram0/1 write protection status */
FlagStatus sram_write_protection_get(uint32_t wp_page);

/* enable tcm ecc error interrupt */
void tcm_ecc_interrupt_enable(uint32_t tcm_id, uint32_t interrupt);
/*disable tcm ecc error interrupt */
void tcm_ecc_interrupt_disable(uint32_t tcm_id, uint32_t interrupt);
/* get tcm error flag is set or not */
FlagStatus tcm_error_flag_get(uint32_t tcm_id, uint32_t flag);
/* clear tcm error flag */
void tcm_error_flag_clear(uint32_t tcm_id, uint32_t flag);

/* get tcm single bit ecc error address */
uint32_t tcm_ecc_single_bit_address_get(uint32_t tcm_id, uint32_t address_index);
/* get tcm double bit ecc error address */
uint32_t tcm_ecc_double_bit_address_get(uint32_t tcm_id);
/* get tcm single bit ecc error address valid status */
FlagStatus tcm_ecc_single_bit_address_valid_get(uint32_t tcm_id, uint32_t address_index);
/* get tcm double bit ecc error address valid status */
FlagStatus tcm_ecc_double_bit_address_valid_get(uint32_t tcm_id);
/* clear tcm single bit ecc error address valid status */
void tcm_ecc_single_bit_address_valid_clear(uint32_t tcm_id, uint32_t address_index);
/* clear tcm double bit ecc error address valid status */
void tcm_ecc_double_bit_address_valid_clear(uint32_t tcm_id);
/* get tcm single bit ecc error address buffer overflow status */
FlagStatus tcm_error_address_buffer_overflow_get(uint32_t tcm_id);
/* clear tcm single bit ecc error address buffer overflow status */
void tcm_error_address_buffer_overflow_clear(uint32_t tcm_id);

/* get tcm ecc code of detected ecc error  */
uint32_t tcm_ecc_code_get(uint32_t tcm_id);
/* configure tcm write protection */
void tcm_write_protect_config(uint32_t wp_page, ControlStatus enable);
/* get tcm write protection status */
FlagStatus tcm_write_protection_get(uint32_t wp_page);

#endif /* GD32A7XX_SRAM_TCM_H */
